<template>
  <pre>
==========================================================================

		Требования к API

    Все параметры для проведения операции передаются в URL
    Все данные, получаемые от сервера должны быть в формате JSON

    Применённые рекомендации по REST API: www.restapitutorial.com

==========================================================================

	Базовый функционал

--------------------------------------------------------------------------

POST /routes - добавление элемента

Параметры:

    name        | string    | обязательный
    x           | float     | обязательный
    y           | float     | обязательный
    from_x      | long      | обязательный
    from_y      | long      | обязательный
    from_z      | long      | обязательный
    from_name   | string    | обязательный
    to_x        | long      | обязательный
    to_Y        | long      | обязательный
    to_z        | long      | обязательный
    to_name     | string    | обязательный

Возвращает: только статус-код

--------------------------------------------------------------------------

GET /routes/{id} - получение элемента с указанным id

Параметры: нет

Возвращает:

    Route | Object

--------------------------------------------------------------------------

PUT /routes/{id} - обновление информации об элементе с указанным id

Параметры:

    name        | string    | опциональный
    x           | float     | опциональный
    y           | float     | опциональный
    from_x      | long      | опциональный
    from_y      | long      | опциональный
    from_z      | long      | опциональный
    from_name   | string    | опциональный
    to_x        | long      | опциональный
    to_Y        | long      | опциональный
    to_z        | long      | опциональный
    to_name     | string    | опциональный

Возвращает: только статус-код

--------------------------------------------------------------------------

DELETE /routes/{id} - удаление элемента с указанным id

Параметры: нет

Возвращает: только статус-код

--------------------------------------------------------------------------

GET /routes - получение массива элементов, поддержка сортировки и
фильтрации по любой комбинации полей, постраничный вывод результатов
выборки с указанием размера и порядкового номера выводимой страницы

Параметры:

    sort_by     | string[] (comma-divided)  | опциональный
    filter_by   | string[] (comma-divided)  | опциональный
    page_size   | int (zero for no limit)   | опциональный
    page_number | int (starts from zero)    | опциональный

Пример фильтра:

    ?filter_by=name!yourname,x!3.14&sort_by=name!asc,y!desc&page_size=0

    * ASC/DESC - порядок сортировки по данному параметру

Возвращает:

    Routes | List&lt;Object&gt;

==========================================================================

	Дополнительный функционал

--------------------------------------------------------------------------

GET /far-route - получение элемента, значение поля to которого
является максимальным

Параметры: нет

Возвращает:

    Route | Object

--------------------------------------------------------------------------

GET /group-coordinates - сгруппировать элементы по значению поля
coordinates, вернуть количество элементов в каждой группе

Параметры: нет

Возвращает:

    groups | Map&lt;Coordinates, int&gt;

--------------------------------------------------------------------------

GET /higher-distance - вернуть количество элементов, значение поля
distance которых больше заданного

Параметры:

    distance | long | обязательный

Возвращает:

    number_of_elements | int

--------------------------------------------------------------------------
    </pre
  >
</template>
